---
title: CopyPasteFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CopyPasteFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 98
---

# CopyPasteFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCopyAttachedType { get; }` | `CopyPasteFailures.CannotCopyAttachedType` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyAttachedTypeWarn { get; }` | `CopyPasteFailures.CannotCopyAttachedTypeWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyBetweenFamilyAndProjectCorruption { get; }` | `CopyPasteFailures.CannotCopyBetweenFamilyAndProjectCorruption` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyBetweenFamilyAndProjectError { get; }` | `CopyPasteFailures.CannotCopyBetweenFamilyAndProjectError` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyCurtainWallGridLines { get; }` | `CopyPasteFailures.CannotCopyCurtainWallGridLines` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyDependentView { get; }` | `CopyPasteFailures.CannotCopyDependentView` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyDetails { get; }` | `CopyPasteFailures.CannotCopyDetails` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyDueToBackgroundCalculation { get; }` | `CopyPasteFailures.CannotCopyDueToBackgroundCalculation` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyDuplicates { get; }` | `CopyPasteFailures.CannotCopyDuplicates` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyElevationArrow { get; }` | `CopyPasteFailures.CannotCopyElevationArrow` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyElevationArrowWarn { get; }` | `CopyPasteFailures.CannotCopyElevationArrowWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyFamilyName { get; }` | `CopyPasteFailures.CannotCopyFamilyName` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyFromProjectAndLink { get; }` | `CopyPasteFailures.CannotCopyFromProjectAndLink` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyGridLines { get; }` | `CopyPasteFailures.CannotCopyGridLines` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyGridLinesWarn { get; }` | `CopyPasteFailures.CannotCopyGridLinesWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyImportInstancesAcrossProjects { get; }` | `CopyPasteFailures.CannotCopyImportInstancesAcrossProjects` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyIncompleteElement { get; }` | `CopyPasteFailures.CannotCopyIncompleteElement` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyIncompleteElementWarn { get; }` | `CopyPasteFailures.CannotCopyIncompleteElementWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyJoinedGeometry { get; }` | `CopyPasteFailures.CannotCopyJoinedGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyJoinedGeometryWarn { get; }` | `CopyPasteFailures.CannotCopyJoinedGeometryWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyLocked { get; }` | `CopyPasteFailures.CannotCopyLocked` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyLockedWarn { get; }` | `CopyPasteFailures.CannotCopyLockedWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMassing { get; }` | `CopyPasteFailures.CannotCopyMassing` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMassingWarn { get; }` | `CopyPasteFailures.CannotCopyMassingWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMullions { get; }` | `CopyPasteFailures.CannotCopyMullions` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMullionsError { get; }` | `CopyPasteFailures.CannotCopyMullionsError` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMullionsWarn { get; }` | `CopyPasteFailures.CannotCopyMullionsWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMultipleSketchParents { get; }` | `CopyPasteFailures.CannotCopyMultipleSketchParents` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMustBeUnique { get; }` | `CopyPasteFailures.CannotCopyMustBeUnique` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyMustBeUniqueWarn { get; }` | `CopyPasteFailures.CannotCopyMustBeUniqueWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyNestedLinks { get; }` | `CopyPasteFailures.CannotCopyNestedLinks` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyNoAttachedParent { get; }` | `CopyPasteFailures.CannotCopyNoAttachedParent` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyNoAttachedParentWarn { get; }` | `CopyPasteFailures.CannotCopyNoAttachedParentWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyNoParents { get; }` | `CopyPasteFailures.CannotCopyNoParents` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyNoReferences { get; }` | `CopyPasteFailures.CannotCopyNoReferences` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyRevolveAxis { get; }` | `CopyPasteFailures.CannotCopyRevolveAxis` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyRevolveAxisWarn { get; }` | `CopyPasteFailures.CannotCopyRevolveAxisWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopySelectedPick { get; }` | `CopyPasteFailures.CannotCopySelectedPick` | FailureDefinitionId |
| `FailureDefinitionId CannotCopySelection { get; }` | `CopyPasteFailures.CannotCopySelection` | FailureDefinitionId |
| `FailureDefinitionId CannotCopySketchGrid { get; }` | `CopyPasteFailures.CannotCopySketchGrid` | FailureDefinitionId |
| `FailureDefinitionId CannotCopySketchGridWarn { get; }` | `CopyPasteFailures.CannotCopySketchGridWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopySunAndShadowSettings { get; }` | `CopyPasteFailures.CannotCopySunAndShadowSettings` | FailureDefinitionId |
| `FailureDefinitionId CannotCopySunAndShadowSettingsWarn { get; }` | `CopyPasteFailures.CannotCopySunAndShadowSettingsWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyWallPanels { get; }` | `CopyPasteFailures.CannotCopyWallPanels` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyWallPanelsWarn { get; }` | `CopyPasteFailures.CannotCopyWallPanelsWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyZone { get; }` | `CopyPasteFailures.CannotCopyZone` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyZoneWarn { get; }` | `CopyPasteFailures.CannotCopyZoneWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicate { get; }` | `CopyPasteFailures.CannotDuplicate` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicateDesignOption { get; }` | `CopyPasteFailures.CannotDuplicateDesignOption` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicateInOption { get; }` | `CopyPasteFailures.CannotDuplicateInOption` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicateInOptionWarn { get; }` | `CopyPasteFailures.CannotDuplicateInOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicateType { get; }` | `CopyPasteFailures.CannotDuplicateType` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicateWarn { get; }` | `CopyPasteFailures.CannotDuplicateWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotFinalizeClusterInconsistency { get; }` | `CopyPasteFailures.CannotFinalizeClusterInconsistency` | FailureDefinitionId |
| `FailureDefinitionId CannotFinalizeOrphanSerf { get; }` | `CopyPasteFailures.CannotFinalizeOrphanSerf` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteAlignedAny { get; }` | `CopyPasteFailures.CannotPasteAlignedAny` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteAlignedCorruption { get; }` | `CopyPasteFailures.CannotPasteAlignedCorruption` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteAlignedError { get; }` | `CopyPasteFailures.CannotPasteAlignedError` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteAlignedSomeLevels { get; }` | `CopyPasteFailures.CannotPasteAlignedSomeLevels` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteAssemblyView { get; }` | `CopyPasteFailures.CannotPasteAssemblyView` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteCircularLinks { get; }` | `CopyPasteFailures.CannotPasteCircularLinks` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteCurtainGridLine { get; }` | `CopyPasteFailures.CannotPasteCurtainGridLine` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteDifferentViewSpecificElements { get; }` | `CopyPasteFailures.CannotPasteDifferentViewSpecificElements` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteElemInViewError { get; }` | `CopyPasteFailures.CannotPasteElemInViewError` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteInSketch { get; }` | `CopyPasteFailures.CannotPasteInSketch` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteInView { get; }` | `CopyPasteFailures.CannotPasteInView` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteInViewError { get; }` | `CopyPasteFailures.CannotPasteInViewError` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteModelPlusViewSpecificElementsIntoView { get; }` | `CopyPasteFailures.CannotPasteModelPlusViewSpecificElementsIntoView` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteNoLevelAbove { get; }` | `CopyPasteFailures.CannotPasteNoLevelAbove` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteNoLevelBelow { get; }` | `CopyPasteFailures.CannotPasteNoLevelBelow` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteNoWorkplane { get; }` | `CopyPasteFailures.CannotPasteNoWorkplane` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteRoomsInNonPlanViews { get; }` | `CopyPasteFailures.CannotPasteRoomsInNonPlanViews` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteToSheet { get; }` | `CopyPasteFailures.CannotPasteToSheet` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteViewSpecElemsFromDiffViews { get; }` | `CopyPasteFailures.CannotPasteViewSpecElemsFromDiffViews` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteViewSpecificElementsIntoPerspectiveView { get; }` | `CopyPasteFailures.CannotPasteViewSpecificElementsIntoPerspectiveView` | FailureDefinitionId |
| `FailureDefinitionId CannotTransferProjectStandards { get; }` | `CopyPasteFailures.CannotTransferProjectStandards` | FailureDefinitionId |
| `FailureDefinitionId CantCopyBetweenModelAndAnnotFam { get; }` | `CopyPasteFailures.CantCopyBetweenModelAndAnnotFam` | FailureDefinitionId |
| `FailureDefinitionId CantCopyElemsToInplaceFam { get; }` | `CopyPasteFailures.CantCopyElemsToInplaceFam` | FailureDefinitionId |
| `FailureDefinitionId CantCopyFrom2dTo3dFam { get; }` | `CopyPasteFailures.CantCopyFrom2dTo3dFam` | FailureDefinitionId |
| `FailureDefinitionId CantCopyFrom3dTo2dFam { get; }` | `CopyPasteFailures.CantCopyFrom3dTo2dFam` | FailureDefinitionId |
| `FailureDefinitionId CantCopyFromDetailToProfileFam { get; }` | `CopyPasteFailures.CantCopyFromDetailToProfileFam` | FailureDefinitionId |
| `FailureDefinitionId CantCopyLevelsOrRefPlanesToNonMassFamily { get; }` | `CopyPasteFailures.CantCopyLevelsOrRefPlanesToNonMassFamily` | FailureDefinitionId |
| `FailureDefinitionId CantCopyStairsLevelHeightNotMatchInMS { get; }` | `CopyPasteFailures.CantCopyStairsLevelHeightNotMatchInMS` | FailureDefinitionId |
| `FailureDefinitionId CantCopySymbolicElementToSelfOrientingFamily { get; }` | `CopyPasteFailures.CantCopySymbolicElementToSelfOrientingFamily` | FailureDefinitionId |
| `FailureDefinitionId CopingColumnBeamFailure { get; }` | `CopyPasteFailures.CopingColumnBeamFailure` | FailureDefinitionId |
| `FailureDefinitionId CopyImposterContentError { get; }` | `CopyPasteFailures.CopyImposterContentError` | FailureDefinitionId |
| `FailureDefinitionId CopyImposterContentWarn { get; }` | `CopyPasteFailures.CopyImposterContentWarn` | FailureDefinitionId |
| `FailureDefinitionId CopyImposterLightError { get; }` | `CopyPasteFailures.CopyImposterLightError` | FailureDefinitionId |
| `FailureDefinitionId CopyImposterLightWarn { get; }` | `CopyPasteFailures.CopyImposterLightWarn` | FailureDefinitionId |
| `FailureDefinitionId ElementRenamedOnPaste { get; }` | `CopyPasteFailures.ElementRenamedOnPaste` | FailureDefinitionId |
| `FailureDefinitionId FinalizedElementsWillBeDeleted { get; }` | `CopyPasteFailures.FinalizedElementsWillBeDeleted` | FailureDefinitionId |
| `FailureDefinitionId FinalizedElementsWillBeDeletedWarn { get; }` | `CopyPasteFailures.FinalizedElementsWillBeDeletedWarn` | FailureDefinitionId |
| `FailureDefinitionId FinalizedElementsWillBeModified { get; }` | `CopyPasteFailures.FinalizedElementsWillBeModified` | FailureDefinitionId |
| `FailureDefinitionId FinalizedElementsWillBeModifiedWarn { get; }` | `CopyPasteFailures.FinalizedElementsWillBeModifiedWarn` | FailureDefinitionId |
| `FailureDefinitionId LostReference { get; }` | `CopyPasteFailures.LostReference` | FailureDefinitionId |
| `FailureDefinitionId NoSketchPlane { get; }` | `CopyPasteFailures.NoSketchPlane` | FailureDefinitionId |
| `FailureDefinitionId PasteInvisibleInView { get; }` | `CopyPasteFailures.PasteInvisibleInView` | FailureDefinitionId |
| `FailureDefinitionId SomeElementsNotCopiedWarn { get; }` | `CopyPasteFailures.SomeElementsNotCopiedWarn` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```